Tekla.Structures.DialogInternal.CDelegateSetter
This class is purely available for the reason to enable faking of
ICDelegate interface for the sake of testing.

Tekla.Structures.DialogInternal.CDelegateSetter.SetInstanceForUnitTesting(Tekla.Structures.DialogInternal.ICDelegate)
Set the current ICDelegate instance to your fake/mock class.
The instance must be restored to null when test method ends.
cdelegate: The delegate implementation